{
    "cell-name": "Yume",
    "cell-id": "Y",
    "color": "#0000ff",
    "classification": 2,
    "alignment": 1,
    
    "exists": true,
    
    "passable": true,
    "occupiable": false,
    "destructable": true,
    "block-ranged": false,
    
    "has-stats": true,
    
    "base-stats": {
        "current-health": 25,
        "max-health": 25,
        "current-mana": 15,
        "max-mana": 15,
        "attack": 4,
        "defense": 3,
        "intelligence": 2,
        "spirit": 2,
        "critical": 5,
        "evasion": 3,
        "guard": 0,
        "accuracy": 100,
        "movement": 3,
        "x-gauge": 0,
        "constitution": 2
    },
            
    "gender": "Female",
    "level": 1,
    "profession": {
        "name": "Drive Engineer",
        "flavor": "The one claims this profession specializes in the operation of the fearsome Drive Blades, trading elaborate technique for highly powerful attacks backed by the potential of their weapon's Drive Cores.", 
        "ba-type": 0
    },

    "equipment": [
        {
            "type": "weapon", 
            "name": "Scrap Blade", 
            "flavor": "Hastily-constructed Drive Blade model, made of scraps and other spare parts. Definitely not the best of Yume's Magitech exploits.", 
            "range": 1,
            "stats": {
                "attack": 1
            }
        },
        {
            "type": "armor", 
            "name": "Light Vest", 
            "flavor": "Though originally purposed as a engineering uniform, it also proves to be adequate for battle.", 
            "stats": {
                "defense": 1
            }
        },
        {
            "type": "accessory", 
            "name": "Old Core", 
            "flavor": "Non-functional core of a high-quality Drive Blade. It has been damaged beyond repair, but seems to be important to Yume somehow.", 
            "stats": {
                "spirit": 1
            }
        }
    ],

    "a-ability": [
        {
            "name": "Driven Strength",
            "a-skills": [
                {
                    "default": "+ Sonic Drive: Astonishingly quick, powerful blow with the user's Drive Blade, generating moderate heat buildup. D-Skill. 160% Atk Damage. Drive Cooldown: 3 Turns. Accuracy: 100%. Variance: 0%. Range: Adjacent Cell. Element: Neutral. 6 MP.",
                    "skill-name": "Sonic Drive",
                    "description": "Astonishingly quick, powerful blow with the user's Drive Blade, generating moderate heat buildup. D-Skill.",
                    "hit-count": 1,
                    "damage": 1.6,
                    "damage-stat": "Atk",
                    "damage-type": "Normal",
                    "status-effect": "N/A",
                    "modifier": "N/A",
                    "cast-time": 0,
                    "cast-type": "Normal",
                    "accuracy": 100,
                    "variance": 0,
                    "range": 1,
                    "element": "Neutral",
                    "chain": "N/A",
                    "mp-cost": 6
                },
                {
                    "default": "+ Coolant Flow: Courses ambient Mana through one's Drive Blade like a cooling agent, also allowing the user to slightly replenish her Mana Pool. Decreases Drive Cooldown by 1 Turn. Chain Cycle Mana. Accuracy: None. Variance: None. Range: Self. Element: Neutral. 2 MP.",
                    "skill-name": "Coolant Flow",
                    "description": "Courses ambient Mana through one's Drive Blade like a cooling agent, also allowing the user to slightly replenish her Mana Pool.",
                    "hit-count": 0,
                    "damage": 0,
                    "status-effect": "If a Status Effect is applied to the target during this A-Skill, that Status Effect is here.",
                    "modifier": "The Chance Modifier for the Status Effect roll. Mod. 0 by default.",
                    "cast-time": 0,
                    "cast-type": "Normal",
                    "accuracy": 100,
                    "variance": 0,
                    "range": 0,
                    "element": "Neutral",
                    "chain": "Cycle Mana",
                    "mp-cost": 2
                },
                {
                    "default": "+ Syphon Drive: Destabilizes the target's Mana Pool with a single slash, causing it to continually leak out and into the user's Drive Blade. D-Skill. 30% Piercing Atk Damage. Absorbs 100% Total Damage as MP. Damage Persist for 3 Turns. On Stack: Refresh. Drive Cooldown: 2 Turns. Accuracy: 100%. Variance: 0%. Range: Adjacent Cell. Element: Neutral. 6 MP.",
                    "skill-name": "Syphon Drive",
                    "description": "Destabilizes the target's Mana Pool with a single slash, causing it to continually leak out and into the user's Drive Blade. D-Skill.",
                    "hit-count": 1,
                    "damage": 0.3,
                    "damage-stat": "Atk",
                    "damage-type": "Piercing",
                    "status-effect": "If a Status Effect is applied to the target during this A-Skill, that Status Effect is here.",
                    "modifier": "The Chance Modifier for the Status Effect roll. Mod. 0 by default.",
                    "cast-time": 0,
                    "cast-type": "Normal",
                    "accuracy": 100,
                    "variance": 0,
                    "range": 1,
                    "element": "Neutral",
                    "mp-cost": 6
                }
            ]
        }
    ],

    "reaction": "None.",
    "support": "None.",
    "burst": "Drive Boost: Overkiller: Increases the Damage Output of the User's Next Basic Attack or Drive Skill by [BOOST*10]%. After this B-Ability's Effects are actualized, BOOST is Reduced to 0. 1 Use Counter.",

    "trigger": "Drive Boost: Chargecore: All Basic Attacks and Drive Skills acquire the Damage Modifier: Destruct. Decreases Drive Cooldown by 5 Turns; if User is Overheated, Dispels Overheat instead. Duration: 3 Turns. 5 X-Levels.",
    "ability": "Ultima Drive: D-Skill. 300% Piercing Atk Damage. Ignores Drive Cooldown if the Turn Counter is less than or equal to [floor(BOOST/2)] Turns. Reduces BOOST to 0. Induces Overheat. Drive Cooldown: 9 Turns. Accuracy: 100%. Variance: None. Range: 3 Cells. Element: Neutral. 10 X-Levels."
}