{
	"cellformat": {
        "cell-name": "The name of the Cell, e.g. Empty Cell, Wall Cell",
        "cell-id": "The identifier of the Cell for display on the Grid",
        "color": "The color of the Cell's identifier as a hexadecimal value",
        "classification": "Unit, Object, Empty...",
        "alignment": "The team alignment of this Cell. Integer...?",
        
        "exists": "A Boolean value for the Cell existing in the first place!",
        
        "passable": "A Boolean value for passability",
        "occupiable": "A Boolean value for occupiability",
        "destructable": "A Boolean value for whether this Cell can be destroyed",
        "block-ranged": "A Boolean value for the Block Property, i.e. can Ranged attacks go through this Cell",
        
        "has-stats": "A Boolean value determining whether or not we care about stat values for this Cell",
        
        "stats": {
            "current-health": "Integer representation of the Cell's current HP",
            "max-health": "Integer representation of the Cell's max HP",
            "current-mana": "Integer representation of the Cell's current MP",
            "max-mana": "Integer representation of the Cell's max MP",
            "attack": "Integer representation of the Cell's Atk stat",
            "defense": "Integer representation of the Cell's Def stat",
            "intelligence": "Integer representation of the Cell's Int stat",
            "spirit": "Integer representation of the Cell's Spr stat",
            "critical": "Integer representation of the Cell's Critical percentage",
            "evasion": "Integer representation of the Cell's Evasion percentage",
            "guard": "Integer representation of the Cell's Guard percentage (used mainly for Shields -- will generally be 0)",
            "movement": "Integer representation of the Cell's Movement stat",
            "x-gauge": "Integer representation of the Cell's current number of excess levels",
            "constitution": "Integer representation of the Cell's Con stat. Will be invisible but used for knockback damage."
        }
	}
}